/**
 * ******************************************************
 * @file                     types.ts
 * @description             「搜索输入框类型定义」
 * 定义搜索输入框的接口和类型
 * @author                  blancnova-web
 * ******************************************************
 */

// ==================================================
// #region 类型定义
// ==================================================

/** 搜索选项接口 */
export interface SearchOption {
  label: string
  value: string | number
  [key: string]: any
}

// #endregion
// ==================================================
